In [9]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [10]:
df = pd.DataFrame(randn(4,3), ['a', 'b', 'c', 'd'], ['X', 'Y', 'Z'])

In [11]:
df

          X         Y         Z
a  0.742256 -0.043391 -0.769868
b  0.218456 -0.181679  0.343759
c  1.563942 -0.385467 -1.092723
d  0.774783  1.914031  0.777774

In [12]:
bool_df = df>0

In [13]:
bool_df

      X      Y      Z
a  True  False  False
b  True  False   True
c  True  False  False
d  True   True   True

In [14]:
df[bool_df]

          X         Y         Z
a  0.742256       NaN       NaN
b  0.218456       NaN  0.343759
c  1.563942       NaN       NaN
d  0.774783  1.914031  0.777774

In [15]:
df[df>0]

          X         Y         Z
a  0.742256       NaN       NaN
b  0.218456       NaN  0.343759
c  1.563942       NaN       NaN
d  0.774783  1.914031  0.777774

In [16]:
df['Y']>1

a    False
b    False
c    False
d     True
Name: Y, dtype: bool

In [17]:
type(df['Y'])

pandas.core.series.Series

In [18]:
df[df['Y']>1]

          X         Y         Z
d  0.774783  1.914031  0.777774

In [19]:
df[df['X']<0]

Empty DataFrame
Columns: [X, Y, Z]
Index: []

In [20]:
res = df[df['X']<0]

In [21]:
res

Empty DataFrame
Columns: [X, Y, Z]
Index: []

In [22]:
res['Z']

Series([], Name: Z, dtype: float64)

In [23]:
df[df['X']<0]['Z']

Series([], Name: Z, dtype: float64)

In [24]:
df[df['X']<0][['Z', 'X']]

Empty DataFrame
Columns: [Z, X]
Index: []

In [25]:
bool_ser = df['X']<0

In [26]:
bool_ser

a    False
b    False
c    False
d    False
Name: X, dtype: bool

In [27]:
result_df = df[bool_ser]

In [28]:
result_df

Empty DataFrame
Columns: [X, Y, Z]
Index: []

In [29]:
result_df[['Z', 'X']]

Empty DataFrame
Columns: [Z, X]
Index: []

In [30]:
df[df['X']<0][['Z', 'X']]

Empty DataFrame
Columns: [Z, X]
Index: []

In [31]:
df[(df['X']>0) & (df['Z']<0)]

          X         Y         Z
a  0.742256 -0.043391 -0.769868
c  1.563942 -0.385467 -1.092723

In [32]:
df[(df['X']>0) | (df['Z']<0)]

          X         Y         Z
a  0.742256 -0.043391 -0.769868
b  0.218456 -0.181679  0.343759
c  1.563942 -0.385467 -1.092723
d  0.774783  1.914031  0.777774

In [33]:
df

          X         Y         Z
a  0.742256 -0.043391 -0.769868
b  0.218456 -0.181679  0.343759
c  1.563942 -0.385467 -1.092723
d  0.774783  1.914031  0.777774

In [34]:
df.reset_index()

  index         X         Y         Z
0     a  0.742256 -0.043391 -0.769868
1     b  0.218456 -0.181679  0.343759
2     c  1.563942 -0.385467 -1.092723
3     d  0.774783  1.914031  0.777774

In [35]:
df.reset_index(inplace=True)

In [36]:
df

  index         X         Y         Z
0     a  0.742256 -0.043391 -0.769868
1     b  0.218456 -0.181679  0.343759
2     c  1.563942 -0.385467 -1.092723
3     d  0.774783  1.914031  0.777774

In [37]:
z1 = [2,3,5,6]

In [38]:
df['z1'] = z1

In [39]:
df

  index         X         Y         Z  z1
0     a  0.742256 -0.043391 -0.769868   2
1     b  0.218456 -0.181679  0.343759   3
2     c  1.563942 -0.385467 -1.092723   5
3     d  0.774783  1.914031  0.777774   6

In [40]:
df1 = pd.DataFrame(randn(4,3), ['a', 'b', 'c', 'd'], ['X', 'Y', 'Z'])

In [41]:
z2 = [2,3,5,6]

In [42]:
df1['z2'] = z2

In [43]:
df1

          X         Y         Z  z2
a -0.997984  0.642890  0.205901   2
b  1.043774  0.819843  0.000614   3
c  0.757023 -0.086599 -1.440910   5
d  0.769923 -0.407263 -0.258021   6

In [44]:
df1.set_index('z2')

           X         Y         Z
z2
2  -0.997984  0.642890  0.205901
3   1.043774  0.819843  0.000614
5   0.757023 -0.086599 -1.440910
6   0.769923 -0.407263 -0.258021

In [45]:
df1

          X         Y         Z  z2
a -0.997984  0.642890  0.205901   2
b  1.043774  0.819843  0.000614   3
c  0.757023 -0.086599 -1.440910   5
d  0.769923 -0.407263 -0.258021   6

In [46]:
df1.set_index('z2', inplace=True)

In [47]:
df1

           X         Y         Z
z2
2  -0.997984  0.642890  0.205901
3   1.043774  0.819843  0.000614
5   0.757023 -0.086599 -1.440910
6   0.769923 -0.407263 -0.258021